[
  {
    "id": 1,
    "lastname": "BESSAM",
    "firstname": "Mounia",
    "age": 22,
    "birth_date": "2003-02-14",
    "birth_place": "Lyon, France 🇫🇷",
    "nationality": "French",
    "role": "Student",
    "strength": "Front-end design and CSS animations",
    "weakness": "Database management",
    "achievement": "Created a full showcase website for a local startup",
    "funfact": "Learned HTML at 12 by customizing her blog.",
    "bio": "Passionate about design and teamwork, Mounia always brings creativity and precision to her work. She enjoys combining aesthetic design with functional code to create immersive user experiences. She has worked on several collaborative projects where she managed layout and visual identity. Outside of studies, she loves art exhibitions and photography, often drawing inspiration from real life for her digital projects."
  },
  {
    "id": 2,
    "lastname": "CATAROSSI",
    "firstname": "Thomas",
    "age": 23,
    "birth_date": "2002-11-05",
    "birth_place": "Nice, France 🇫🇷",
    "nationality": "French",
    "role": "Student",
    "strength": "JavaScript and interactive features",
    "weakness": "Code organization and commenting",
    "achievement": "Developed a JavaScript mini-game awarded at a hackathon",
    "funfact": "Codes mostly at night with a strong coffee.",
    "bio": "Thomas is a passionate web developer who enjoys turning creative ideas into dynamic web experiences. His favorite part of coding lies in making websites feel alive through smooth interactions and animations. He is constantly experimenting with new JS frameworks and exploring optimization techniques. When he’s not coding, Léo spends his time taking street photographs or listening to film soundtracks that inspire his next coding session."
  },
  {
    "id": 3,
    "lastname": "DAHDOUH",
    "firstname": "Ahmed",
    "age": 21,
    "birth_date": "2004-03-09",
    "birth_place": "Brussels, Belgium 🇧🇪",
    "nationality": "Belgian",
    "role": "Student",
    "strength": "Front-end frameworks (React, Vue)",
    "weakness": "Performance optimization",
    "achievement": "Contributed to an open-source mobile app project",
    "funfact": "Can code faster than his cat can chase a mouse.",
    "bio": "Curious and self-motivated, Ahmed has a deep interest in JavaScript frameworks and UI development. He loves exploring new technologies and pushing himself to write cleaner and more efficient code. He believes that accessibility and usability are key aspects of any successful product. Outside his studies, he enjoys painting, gaming, and hiking — often combining her artistic vision with technical skills."
  },
  {
    "id": 4,
    "lastname": "EL MOURABIT",
    "firstname": "Badre",
    "age": 24,
    "birth_date": "2001-08-12",
    "birth_place": "Paris, France 🇫🇷",
    "nationality": "French",
    "role": "Student",
    "strength": "Backend development and REST APIs",
    "weakness": "CSS and visual design",
    "achievement": "Built a secure API for a student carpooling app",
    "funfact": "Collects vintage mechanical keyboards.",
    "bio": "Badre is a backend-oriented developer who thrives in solving complex logic problems. He enjoys building robust and scalable APIs, focusing on clean architecture and security. His curiosity drives him to constantly improve his technical knowledge. When not coding, he loves tinkering with old hardware and building small electronic devices."
  },
  {
    "id": 5,
    "lastname": "EZ-ZAHER",
    "firstname": "Manal",
    "age": 22,
    "birth_date": "2003-06-20",
    "birth_place": "Marseille, France 🇫🇷",
    "nationality": "French",
    "role": "Student",
    "strength": "Graphic design and UX/UI",
    "weakness": "JavaScript optimization",
    "achievement": "Won a student interface design competition",
    "funfact": "Creates color palettes inspired by sunsets.",
    "bio": "Manal bridges the worlds of art and technology. With an eye for design and a love for coding, she brings creativity to every project she touches. Her goal is to make digital experiences both beautiful and intuitive. She’s also a photography enthusiast who often uses her own pictures as design references."
  },
  {
    "id": 6,
    "lastname": "GHOULAM",
    "firstname": "Mehdi",
    "age": 25,
    "birth_date": "2000-12-02",
    "birth_place": "Montreal, Canada 🇨🇦",
    "nationality": "Canadian",
    "role": "Student",
    "strength": "Cybersecurity and Python scripting",
    "weakness": "Front-end development",
    "achievement": "Found and fixed an XSS vulnerability in a school project",
    "funfact": "Changes keyboard every project 'for inspiration.'",
    "bio": "Mehdi has a strong technical mindset and loves security-oriented coding. His favorite challenges involve penetration testing and data protection. He values precision, consistency, and automation in his work. Outside of programming, he’s passionate about gaming, retro computing, and exploring new productivity tools."
  },
  {
    "id": 7,
    "lastname": "KILIMOU",
    "firstname": "Pouwedeou ambroise",
    "age": 22,
    "birth_date": "2003-04-15",
    "birth_place": "Toulouse, France 🇫🇷",
    "nationality": "French",
    "role": "Student",
    "strength": "UI prototyping and UX design",
    "weakness": "Complex data structures",
    "achievement": "Led the design of a collaborative educational app",
    "funfact": "Codes while listening to lo-fi playlists.",
    "bio": "Ambroise is a designer at heart and a developer by curiosity. He loves creating interfaces that feel natural and intuitive. His attention to detail helps teams deliver user-friendly projects. He’s particularly interested in design psychology and accessibility. Outside school, Ambroise enjoys digital art and reading design blogs."
  },
  {
    "id": 8,
    "lastname": "LOVICHI",
    "firstname": "Dorian",
    "age": 23,
    "birth_date": "2002-05-10",
    "birth_place": "Geneva, Switzerland 🇨🇭",
    "nationality": "Swiss",
    "role": "Student",
    "strength": "Database design and SQL",
    "weakness": "Responsive layouts",
    "achievement": "Designed an optimized ERP database model",
    "funfact": "Drinks cold coffee on purpose.",
    "bio": "Dorian is a data-driven thinker who enjoys structuring information efficiently. He believes good design starts with good data. He’s passionate about logical systems and backend design, but also curious about front-end frameworks. When he’s not coding, you’ll find him hiking or experimenting with espresso recipes."
  },
  {
    "id": 9,
    "lastname": "MAHAM BOWBA",
    "firstname": "Youssouf",
    "age": 21,
    "birth_date": "2004-01-25",
    "birth_place": "Casablanca, Morocco 🇲🇦",
    "nationality": "Moroccan",
    "role": "Student",
    "strength": "Clean, accessible front-end design",
    "weakness": "Advanced algorithms",
    "achievement": "Won a web accessibility award",
    "funfact": "Never codes without a hot chocolate.",
    "bio": "Youssouf is known for his strong attention to accessibility and inclusive design. He believes that technology should be usable by everyone. His coding style is clean, readable, and always centered on user experience. Outside coding, he enjoys photography and volunteering for digital inclusion programs."
  },
  {
    "id": 10,
    "lastname": "MARCHISELLI",
    "firstname": "Anthony",
    "age": 24,
    "birth_date": "2001-10-07",
    "birth_place": "Berlin, Germany 🇩🇪",
    "nationality": "German",
    "role": "Student",
    "strength": "Node.js and backend APIs",
    "weakness": "Visual design",
    "achievement": "Built a Discord bot used by 500+ people",
    "funfact": "Plays piano between commits.",
    "bio": "Anthony is a pragmatic problem-solver who enjoys designing reliable backend architectures. He loves Node.js and has a particular interest in cloud deployment and automation. He values teamwork and enjoys mentoring classmates. Outside school, he plays classical piano and enjoys building DIY projects."
  },
  {
    "id": 11,
    "lastname": "MENGHI",
    "firstname": "Anthony",
    "age": 22,
    "birth_date": "2003-09-02",
    "birth_place": "Nantes, France 🇫🇷",
    "nationality": "French",
    "role": "Student",
    "strength": "Creative front-end design",
    "weakness": "Server-side scripting",
    "achievement": "Designed the interface of a local cultural festival website",
    "funfact": "Collects laptop stickers.",
    "bio": "Anthony is a creative mind who mixes art and code. He enjoys using HTML, CSS, and JavaScript to build expressive interfaces. He constantly looks for inspiration in digital art communities and believes in emotional design. Outside school, he paints and sketches his favorite UI layouts."
  },
  {
    "id": 12,
    "lastname": "MICHELOZZI",
    "firstname": "Matthieu",
    "age": 23,
    "birth_date": "2002-07-19",
    "birth_place": "Lille, France 🇫🇷",
    "nationality": "French",
    "role": "Student",
    "strength": "Machine learning and Python",
    "weakness": "Front-end development",
    "achievement": "Trained a local weather prediction model",
    "funfact": "Owns a folder with 300 coding memes.",
    "bio": "Matthieu is passionate about data science and automation. He enjoys analyzing real-world problems and turning data into insights. His curiosity pushes him to explore new machine learning frameworks and AI techniques. When not studying, he contributes to open-source projects and experiments with Raspberry Pi devices."
  },
  {
    "id": 13,
    "lastname": "MIRANDE",
    "firstname": "Clémentine",
    "age": 22,
    "birth_date": "2003-05-21",
    "birth_place": "Lyon, France 🇫🇷",
    "nationality": "French",
    "role": "Student",
    "strength": "Team coordination and project structure",
    "weakness": "Complex algorithms",
    "achievement": "Led the development of a full non-profit website",
    "funfact": "Keeps a post-it for every bug she fixes.",
    "bio": "Clémentine is an excellent communicator and team leader. She thrives when coordinating people and ensuring that projects run smoothly. Her structured approach helps her manage deadlines and encourage collaboration. In her free time, she enjoys writing, traveling, and discovering new productivity apps."
  },
  {
    "id": 14,
    "lastname": "POIRIER",
    "firstname": "Achille",
    "age": 24,
    "birth_date": "2001-11-30",
    "birth_place": "Lausanne, Switzerland 🇨🇭",
    "nationality": "Swiss",
    "role": "Student",
    "strength": "Software architecture",
    "weakness": "Visual design",
    "achievement": "Refactored an app to cut loading time by 50%",
    "funfact": "Uses a custom violet mechanical keyboard.",
    "bio": "Achille is a logical thinker who loves building scalable systems. He believes in writing maintainable, clean code and often serves as a code reviewer in his team. He’s fascinated by software performance and optimization. Outside programming, he plays guitar and enjoys hiking in the Swiss Alps."
  },
  {
    "id": 15,
    "lastname": "ROBLES",
    "firstname": "Nicolas",
    "age": 21,
    "birth_date": "2004-09-11",
    "birth_place": "Bordeaux, France 🇫🇷",
    "nationality": "French",
    "role": "Student",
    "strength": "Project management and agile methodology",
    "weakness": "Networking concepts",
    "achievement": "Managed a 6-person team for a full web project",
    "funfact": "Adds an emoji to every Git commit.",
    "bio": "Nicolas is organized and enthusiastic about managing digital projects. He enjoys planning sprints, coordinating teams, and ensuring good communication between designers and developers. He believes that a happy team builds better software. Outside classes, He enjoys photography and creative writing."
  },
  {
    "id": 16,
    "lastname": "SECK",
    "firstname": "Abdou samath",
    "age": 25,
    "birth_date": "2000-10-16",
    "birth_place": "Dakar, Sénégal",
    "nationality": "Sénégal",
    "role": "Student",
    "strength": "Data analysis and Python scripting",
    "weakness": "Front-end design",
    "achievement": "Worked on a public data visualization project",
    "funfact": "Never leaves his laptop without pushing to Git.",
    "bio": "Abdou samath loves solving data-related problems. He enjoys working with datasets, building analytics dashboards, and making data accessible to everyone. He’s constantly learning new tools like Pandas, NumPy, and Power BI. Outside school, he’s passionate about chess, statistics, and jazz music."
  },
  {
    "id": 17,
    "lastname": "THIRY",
    "firstname": "Stéphane",
    "age": 27,
    "birth_date": "1998-04-08",
    "birth_place": "Ajaccio, France 🇫🇷",
    "nationality": "French",
    "role": "Student",
    "strength": "Object-oriented programming and mobile app development",
    "weakness": "Web development",
    "achievement": "Built a full-featured desktop automation tool in Python using PyQt6 that executes Excel macros faster than VBA.",
    "funfact": "Sometimes forgets to name variables properly but always remembers the logic behind them.",
    "bio": "Stéphane Thiry is a 27-year-old French developer born in Ajaccio, passionate about building practical and intelligent software solutions. His main technical strengths lie in object-oriented programming and mobile app development, where he enjoys combining logical structures with creativity.<br><br>From an early age, Stéphane was fascinated by technology and how small pieces of code could make a computer perform something meaningful. Over the years, this curiosity turned into a real passion for software engineering. He has a natural ability to understand complex systems and find elegant solutions to technical challenges.<br><br>His proudest achievement so far is the creation of a complete desktop automation tool using Python and PyQt6, designed to execute Excel macros faster than VBA. This project demonstrates both his mastery of programming logic and his strong interest in efficiency and automation. Stéphane believes that programming is not just about writing code but about crafting tools that genuinely make people’s work easier and smarter.<br><br>Beyond coding, he has a strong interest in technology applied to real-world productivity. He loves optimizing workflows, improving user experience, and exploring how software can remove repetitive work. He is also curious about AI and automation, two fields he plans to explore further.<br><br>In the future, Stéphane aims to work at EDF to contribute to technological innovation in the energy sector. Alternatively, he sees himself working as a freelance developer while dedicating time to his musical passion, composing, and experimenting with sound design. He believes that both music and programming share a common essence: structure, rhythm, and emotion.<br><br>Fun fact: Stéphane once debugged an entire script while playing guitar between tests — proving that creativity can take many forms."
  },
  {
    "id": 18,
    "lastname": "ABBOURI",
    "firstname": "Hafsa",
    "age": 23,
    "birth_date": "2002-03-23",
    "birth_place": "Lyon, France 🇫🇷",
    "nationality": "French",
    "role": "Student",
    "strength": "Debugging and performance optimization",
    "weakness": "Creative design",
    "achievement": "Optimized a Python script to run 80% faster",
    "funfact": "Solves bugs like solving riddles.",
    "bio": "Hafsa is a meticulous and curious programmer who loves challenges. She has a strong eye for details and enjoys finding efficient solutions to performance issues. He believes that every bug has a story and that solving it makes him a better coder. When not debugging, he enjoys hiking and learning about new technologies."
  }
]